using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class istructions : MonoBehaviour
{
    
    private Transform speackTarget;
    public PopUpSystem pop;
    private List<string> lines =new List<string>() {
        "Ρεαλισμός:",
        "Ο ρεαλισμός ήταν το κυρίαρχο στυλ από την Αναγέννηση. Χρησιμοποιείται προοπτική για να δημιουργήσει",
        "μια ψευδαίσθηση χώρου και βάθους. Ρυθμίζοντας τη σύνθεση και τον φωτισμό έτσι ώστε το θέμα να φαίνεται πραγματικό.",
        "",
        "Ιμπρεσιονισμός:","Βασίζεται στην άμεση εντύπωση που μας προκαλεί μια καθημερινή εικόνα. Χαρακτηρίζεται από ζωντανά",
        "χρώματα. Συνήθως σχεδιάζονται εξωτερικά τοπία ή συνηθισμένα αντικείμενα και δίνεται έμφαση στο φωτισμό με λεπτές πινελιές.",
        "",
        "Μεταιμπρεσιονισμός:",
        "Έχει τις τεχνικές του ιμπρεσιονισμού αλλά περισσότερο συναισθηματισμό στο έργο!",
        "",
        "Εξπρεσιονισμός:",
        "Εντάσσεται στην αφηριμένη τέχνη. Παραμορφώνεται η πραγματικότητα και είναι έντονο το χαρακτηριστικό της αγωνίας.",
        "Λίγα έργα έχουν χαρούμενη διάθεση. Περιλαμβάνει διαφορετικά στυλ και τεχνικές και τονίζει την ελευθερία και ",
        "συναισθήματα χωρίς ιδιαίτερες αναπαραστάσεις",
        "",
        "Σουρεαλισμός:",
        "Στον σουρεαλισμό τα έργα προσπαθούσαν να ξεπεράσουν τα όρια της φαντασίας με παράλογες εικόνες",
        "- προσπάθησε να απελευθερώσει τις δημιουργικές δυνατότητες του μυαλού.",
        "",
        "Αφηρημένη τέχνη.",
        "Τέχνη η οποία δεν ζωγραφίζονται τα αντικείμενα όπως είναι στην πραγματικότητα αλλά πιο ελεύθερα και οι γραμμές και",
        "τα σχήματα δεν αναπαριστούν κάτι συγκεκριμένο.",
        "",
        "Κυβισμός",
        "Στον κυβισμό τα σώματα στο χώρο περιγράφονται από γεωμετρικά σχήματα στον καμβά.",
        "",
        "Ποπ Αρτ:",
        "Η Ποπ Αρτ αντλούσε την έμπνευσή της από τις εικόνες της καταναλωτικής κοινωνίας και της λαϊκής κουλτούρας. Χαρακτηριστικά της",
        " αποτέλεσαν ο αυθορμητισμός, η υπερβολή, η ανάλαφρη διάθεση, η σάτιρα, οι έντονες χρωματικές αντιθέσεις και εν γένει η απόρριψη",
        "του παραδοσιακού."
    };
    //public string str =	"Ρεαλισμός:\nΟ ρεαλισμός ήταν το κυρίαρχο στυλ από την Αναγέννηση.\nΧρησιμοποιείται προοπτική για να δημιουργήσει μια ψευδαίσθηση χώρου και βάθους.\nΡυθμίζοντας τη σύνθεση και τον φωτισμό έτσι ώστε το θέμα να φαίνεται πραγματικό.\n\nΙμπρεσιονισμός:\nΒασίζεται στην άμεση εντύπωση που μας προκαλεί μια καθημερινή εικόνα.\nΧαρακτηρίζεται από ζωντανά χρώματα. Συνήθως σχεδιάζονται εξωτερικά \nτοπία ή συνηθισμένα αντικείμενα και δίνεται έμφαση στο φωτισμό με λεπτές πινελιές.\n\nΜεταιμπρεσιονισμός:\nέχει τις τεχνικές του ιμπρεσιονισμού αλλά περισσότερο συναισθηματισμό στο έργο!\n\nΕξπρεσιονισμός:\nΕντάσσεται στην αφηριμένη τέχνη. Παραμορφώνεται η πραγματικότητα και είναι\nέντονο το χαρακτηριστικό της αγωνίας. Λίγα έργα έχουν χαρούμενη διάθεση.\nΠεριλαμβάνει διαφορετικά στυλ και τεχνικές και τονίζει την ελευθερία και συναισθήματα χωρίς ιδιαίτερες αναπαραστάσεις\n\nΣουρεαλισμός:\nΣτον σουρεαλισμό τα έργα προσπαθούσαν να ξεπεράσουν τα όρια της φαντασίας με παράλογες εικόνες \n-  προσπάθησε να απελευθερώσει τις δημιουργικές δυνατότητες του μυαλού.\n\nΑφηρημένη τέχνη.\nΤέχνη η οποία δεν ζωγραφίζονται τα αντικείμενα όπως είναι στην πραγματικότητα αλλά πιο ελεύθερα\n και οι γραμμές και τα σχήματα δεν αναπαριστούν κάτι συγκεκριμένο.\n\nΚυβισμός\nΣτον κυβισμό τα σώματα στο χώρο περιγράφονται από γεωμετρικά σχήματα στον καμβά.\n\nΠοπ Αρτ:\nΗ Ποπ Αρτ αντλούσε την έμπνευσή της από τις εικόνες της καταναλωτικής κοινωνίας και της λαϊκής κουλτούρας.\nΧαρακτηριστικά της αποτέλεσαν ο αυθορμητισμός, η υπερβολή, η ανάλαφρη διάθεση, η σάτιρα,\nοι έντονες χρωματικές αντιθέσεις και εν γένει η απόρριψη του παραδοσιακού.";
    void OnTriggerEnter2D(Collider2D other)
    {
        speackTarget = GameObject.FindGameObjectWithTag("Player").GetComponent<Transform>();
    }

    void OnTriggerExit2D(Collider2D other)
    {
        speackTarget = null;
    }
    
    // Start is called before the first frame update
    void Start()
    {
        
    }

    // Update is called once per frame

    void Update() 
    {   

        if(speackTarget){
            GameObject popupbox = GameObject.Find("Game Manager").gameObject;
            pop = popupbox.GetComponent<PopUpSystem>();
            if( Input.GetKeyDown("space"))
            {
                if(pop.popUpBox.GetComponent<Animator>().GetCurrentAnimatorStateInfo(0).IsName("pop"))
                {   
                    pop.popUpBox.GetComponent<Animator>().Play("Base Layer.close", 0, 0.25f);
                }
                else
                {
                    ShowSpeechTextPop();
                }
            }
        }
    }

    void ShowSpeechTextPop()
    {   
        GameObject popupbox = GameObject.Find("Game Manager").gameObject;
        pop = popupbox.GetComponent<PopUpSystem>();

        pop.popUpText.text = string.Join('\n',lines);
        pop.PopUp();
    }
}
